### Pandas Merging and Joining

In [3]:
import pandas as pd
import numpy as np
import os
import warnings
warnings.filterwarnings("ignore")

In [4]:
os.listdir()

['.ipynb_checkpoints', 'Random_Sales.xlsx', 'Superstore.csv', 'Untitled.ipynb']

In [5]:
# Get all worksheets from a workbook
worksheets = pd.read_excel("Random_Sales.xlsx", sheet_name=None)

In [6]:
# now your worksheets is dictionary
type(worksheets)

dict

In [8]:
worksheets.keys()

dict_keys(['Orders', 'Amit', 'Pushpanjali', 'Om', 'Returns', 'Ankita'])

In [9]:
pd.ExcelFile("Random_Sales.xlsx").sheet_names

['Orders', 'Amit', 'Pushpanjali', 'Om', 'Returns', 'Ankita']

In [10]:
orders = pd.read_excel("Random_Sales.xlsx", sheet_name="Orders")

In [11]:
orders.shape

(5000, 5)

In [12]:
orders.head()

         Order ID         Customer       City  Quantity  Price
0  NJ-2016-152156    Raymond Young       Troy         6  12.42
1  NJ-2016-138688       Helen Dean  Westfield         7  17.83
2  WA-2015-108966   Shirley Chavez    Seattle         2  53.35
3  NJ-2014-115812       Brian Ryan  Westfield         1  53.35
4  NJ-2017-114412  Benjamin Willis  Westfield         3  17.83

In [13]:
returns = pd.read_excel("Random_Sales.xlsx", sheet_name="Returns")

In [14]:
returns.shape

(2000, 4)

In [16]:
returns.head(2)

         Order ID       Customer       City       State
0  NJ-2016-273214  Raymond Young       Troy    New York
1  NJ-2016-271456     Helen Dean  Westfield  New Jersey

In [17]:
orders.head(2)

         Order ID       Customer       City  Quantity  Price
0  NJ-2016-152156  Raymond Young       Troy         6  12.42
1  NJ-2016-138688     Helen Dean  Westfield         7  17.83

In [18]:
# Get state column in orders table

In [19]:
# Inner Join : Gives common records from both the dataframe

In [20]:
innerJoin = pd.merge(left=orders, right=returns, 
                     how="inner", on = 'Order ID')

In [22]:
print(f"Orders table : {orders.shape} and Returns Table : {returns.shape}")

Orders table : (5000, 5) and Returns Table : (2000, 4)

In [23]:
innerJoin.shape

(89, 8)

In [24]:
innerJoin.head()

,Order ID,Customer_x,City_x,Quantity,Price,Customer_y,City_y,State
0,WA-2016-117590,Judy Sanchez,Seattle,7,53.35,Judy Sanchez,Seattle,Washington
1,WA-2015-117415,Harold Hunter,Seattle,4,12.42,Harold Hunter,Seattle,Washington
2,MA-2017-120999,Lori Shaw,Lowell,7,16.32,Lori Shaw,Lowell,Massachusetts
3,NJ-2016-101343,Sandra Hicks,Troy,1,53.35,Sandra Hicks,Troy,New York
4,MA-2017-139619,Roger Gomez,Lowell,7,16.32,Roger Gomez,Lowell,Massachusetts

In [27]:
innerJoin = pd.merge(left=orders, right=returns[["Order ID","State"]],
                     how="inner", on = 'Order ID')

In [28]:
innerJoin.shape

(89, 6)

In [29]:
innerJoin.head()

         Order ID       Customer     City  Quantity  Price          State
0  WA-2016-117590   Judy Sanchez  Seattle         7  53.35     Washington
1  WA-2015-117415  Harold Hunter  Seattle         4  12.42     Washington
2  MA-2017-120999      Lori Shaw   Lowell         7  16.32  Massachusetts
3  NJ-2016-101343   Sandra Hicks     Troy         1  53.35       New York
4  MA-2017-139619    Roger Gomez   Lowell         7  16.32  Massachusetts

In [30]:
# InnerJoin(Common or Natural Join) : 89

In [31]:
# Left Join : You will get whatever the count of left table
# Left records with matching records

In [32]:
leftJoin = pd.merge(left=orders, right=returns[["Order ID","State"]],
                     how="left", on = 'Order ID')

In [33]:
orders.shape[0]

5000

In [34]:
leftJoin.shape

(5000, 6)

In [40]:
leftJoin[12:18]

          Order ID          Customer     City  Quantity  Price       State
12  MA-2015-106320    Walter Kennedy   Lowell         1  12.42         NaN
13  WA-2016-121755  Pamela Alexander  Seattle         4  12.42         NaN
14  NJ-2015-150630     Gloria Harper     Troy         8  16.32         NaN
15  NJ-2017-107727     Harold Hunter     Troy        10  53.35         NaN
16  WA-2016-117590      Judy Sanchez  Seattle         7  53.35  Washington
17  WA-2015-117415     Harold Hunter  Seattle         4  12.42  Washington

In [41]:
leftJoin = pd.merge(left=orders, right=returns[["Order ID","State"]],
                     how="left", on = 'Order ID', indicator=True)

In [42]:
leftJoin.shape

(5000, 7)

In [43]:
leftJoin.head()

,Order ID,Customer,City,Quantity,Price,State,_merge
0,NJ-2016-152156,Raymond Young,Troy,6,12.42,NaN,left_only
1,NJ-2016-138688,Helen Dean,Westfield,7,17.83,NaN,left_only
2,WA-2015-108966,Shirley Chavez,Seattle,2,53.35,NaN,left_only
3,NJ-2014-115812,Brian Ryan,Westfield,1,53.35,NaN,left_only
4,NJ-2017-114412,Benjamin Willis,Westfield,3,17.83,NaN,left_only

In [46]:
leftJoin["_merge"].value_counts().reset_index()

       _merge  count
0   left_only   4911
1        both     89
2  right_only      0

In [47]:
# Returns : 2000

In [50]:
rightJoin = pd.merge(left=orders[["Order ID","Price"]], right=returns,
                     how="right", on = 'Order ID', indicator=True)

In [51]:
rightJoin.shape

(2000, 6)

In [53]:
rightJoin._merge.value_counts().reset_index()

       _merge  count
0  right_only   1911
1        both     89
2   left_only      0

In [54]:
fullJoin = pd.merge(left=orders[["Order ID","Price"]], right=returns,
                     how="outer", on = 'Order ID', indicator=True)

In [55]:
fullJoin.shape

(6911, 6)

In [56]:
fullJoin._merge.value_counts().reset_index()

       _merge  count
0   left_only   4911
1  right_only   1911
2        both     89

In [57]:
ord1 = pd.read_clipboard()

In [58]:
ord1

         Order ID         Customer       City  Quantity  Price
0  NJ-2016-152156    Raymond Young       Troy         6  12.42
1  NJ-2016-138688       Helen Dean  Westfield         7  17.83
2  WA-2015-108966   Shirley Chavez    Seattle         2  53.35
3  NJ-2014-115812       Brian Ryan  Westfield         1  53.35
4  NJ-2017-114412  Benjamin Willis  Westfield         3  17.83

In [59]:
ret1 = pd.read_clipboard()

In [60]:
ret1

         Order ID         Customer       City       State
0  NJ-2014-115812    Raymond Young       Troy    New York
1  NJ-2014-115812       Helen Dean  Westfield  New Jersey
2  NJ-2014-115812   Shirley Chavez    Seattle  Washington
3  NJ-2014-115812       Brian Ryan  Westfield  New Jersey
4  NJ-2014-115812  Benjamin Willis  Westfield  New Jersey
5  WA-2016-362144    Annie Jenkins    Seattle  Washington

In [63]:
innerJoin = pd.merge(left=ord1, right=ret1[["Order ID","State"]],
                     how="inner", on = 'Order ID')

In [64]:
innerJoin.shape

(5, 6)

In [65]:
innerJoin.shape

(5, 6)

In [66]:
innerJoin.head()

         Order ID    Customer       City  Quantity  Price       State
0  NJ-2014-115812  Brian Ryan  Westfield         1  53.35    New York
1  NJ-2014-115812  Brian Ryan  Westfield         1  53.35  New Jersey
2  NJ-2014-115812  Brian Ryan  Westfield         1  53.35  Washington
3  NJ-2014-115812  Brian Ryan  Westfield         1  53.35  New Jersey
4  NJ-2014-115812  Brian Ryan  Westfield         1  53.35  New Jersey

In [69]:
# In the cross Join no need to provide on parameter

pd.merge(ord1[:2],ret1[:2],how='cross')

,Order ID_x,Customer_x,City_x,Quantity,Price,Order ID_y,Customer_y,City_y,State
0,NJ-2016-152156,Raymond Young,Troy,6,12.42,NJ-2014-115812,Raymond Young,Troy,New York
1,NJ-2016-152156,Raymond Young,Troy,6,12.42,NJ-2014-115812,Helen Dean,Westfield,New Jersey
2,NJ-2016-138688,Helen Dean,Westfield,7,17.83,NJ-2014-115812,Raymond Young,Troy,New York
3,NJ-2016-138688,Helen Dean,Westfield,7,17.83,NJ-2014-115812,Helen Dean,Westfield,New Jersey

In [70]:
# pd.concat

In [76]:
ord1 = pd.read_clipboard()

In [77]:
ord1

         Order ID          Customer       City  Quantity
0  NJ-2016-152156     Raymond Young       Troy         6
1  NJ-2016-138688        Helen Dean  Westfield         7
2  WA-2015-108966    Shirley Chavez    Seattle         2
3  NJ-2014-115812        Brian Ryan  Westfield         1
4  NJ-2017-114412   Benjamin Willis  Westfield         3
5  WA-2016-161389     Annie Jenkins    Seattle         6
6  NJ-2015-118983  Christina Little       Troy         6
7  WA-2014-105893     Annie Jenkins    Seattle         9
8  NJ-2014-167164     Ruby Matthews       Troy         6

In [78]:
ret1 = pd.read_clipboard()

In [73]:
# ret1.rename(columns={"City" : "Village"}, inplace = True)

In [79]:
ret1

         Order ID          Customer    Village  Quantity
0  NJ-2016-152156     Raymond Young       Troy         6
1  NJ-2016-138688        Helen Dean  Westfield         7
2  WA-2015-108966    Shirley Chavez    Seattle         2
3  NJ-2014-115812        Brian Ryan  Westfield         1
4  NJ-2017-114412   Benjamin Willis  Westfield         3
5  WA-2016-161389     Annie Jenkins    Seattle         6
6  NJ-2015-118983  Christina Little       Troy         6
7  WA-2014-105893     Annie Jenkins    Seattle         9
8  NJ-2014-167164     Ruby Matthews       Troy         6

In [84]:
result = pd.concat([ord1,ret1], axis = 0)

In [85]:
result

         Order ID          Customer       City  Quantity    Village
0  NJ-2016-152156     Raymond Young       Troy         6        NaN
1  NJ-2016-138688        Helen Dean  Westfield         7        NaN
2  WA-2015-108966    Shirley Chavez    Seattle         2        NaN
3  NJ-2014-115812        Brian Ryan  Westfield         1        NaN
4  NJ-2017-114412   Benjamin Willis  Westfield         3        NaN
5  WA-2016-161389     Annie Jenkins    Seattle         6        NaN
6  NJ-2015-118983  Christina Little       Troy         6        NaN
7  WA-2014-105893     Annie Jenkins    Seattle         9        NaN
8  NJ-2014-167164     Ruby Matthews       Troy         6        NaN
0  NJ-2016-152156     Raymond Young        NaN         6       Troy
1  NJ-2016-138688        Helen Dean        NaN         7  Westfield
2  WA-2015-108966    Shirley Chavez        NaN         2    Seattle
3  NJ-2014-115812        Brian Ryan        NaN         1  Westfield
4  NJ-2017-114412   Benjamin Willis        NaN         3  Westfield
5  WA-2016-161389     Annie Jenkins        NaN         6    Seattle
6  NJ-2015-118983  Christina Little        NaN         6       Troy
7  WA-2014-105893     Annie Jenkins        NaN         9    Seattle
8  NJ-2014-167164     Ruby Matthews        NaN         6       Troy

In [83]:
pd.concat([ord1,ret1], axis = 1)
# axis = 0 : rows
# axis = 1 : columns

,Order ID,Customer,City,Quantity,Order ID,Customer,Village,Quantity
0,NJ-2016-152156,Raymond Young,Troy,6,NJ-2016-152156,Raymond Young,Troy,6
1,NJ-2016-138688,Helen Dean,Westfield,7,NJ-2016-138688,Helen Dean,Westfield,7
2,WA-2015-108966,Shirley Chavez,Seattle,2,WA-2015-108966,Shirley Chavez,Seattle,2
3,NJ-2014-115812,Brian Ryan,Westfield,1,NJ-2014-115812,Brian Ryan,Westfield,1
4,NJ-2017-114412,Benjamin Willis,Westfield,3,NJ-2017-114412,Benjamin Willis,Westfield,3
5,WA-2016-161389,Annie Jenkins,Seattle,6,WA-2016-161389,Annie Jenkins,Seattle,6
6,NJ-2015-118983,Christina Little,Troy,6,NJ-2015-118983,Christina Little,Troy,6
7,WA-2014-105893,Annie Jenkins,Seattle,9,WA-2014-105893,Annie Jenkins,Seattle,9
8,NJ-2014-167164,Ruby Matthews,Troy,6,NJ-2014-167164,Ruby Matthews,Troy,6

In [88]:
pd.append?

Object `pd.append` not found.

In [92]:
ord1.columns

Index(['Order ID', 'Customer', 'City', 'Quantity'], dtype='object')

In [93]:
ret1.columns

Index(['Order ID', 'Customer', 'Village', 'Quantity'], dtype='object')

In [105]:
ord1

         Order ID          Customer       City  Quantity
0  NJ-2016-152156     Raymond Young       Troy         6
1  NJ-2016-138688        Helen Dean  Westfield         7
2  WA-2015-108966    Shirley Chavez    Seattle         2
3  NJ-2014-115812        Brian Ryan  Westfield         1
4  NJ-2017-114412   Benjamin Willis  Westfield         3
5  WA-2016-161389     Annie Jenkins    Seattle         6
6  NJ-2015-118983  Christina Little       Troy         6
7  WA-2014-105893     Annie Jenkins    Seattle         9
8  NJ-2014-167164     Ruby Matthews       Troy         6

In [106]:
ret1

         Order ID          Customer    Village  Quantity
0  NJ-2016-152156     Raymond Young       Troy         6
1  NJ-2016-138688        Helen Dean  Westfield         7
2  WA-2015-108966    Shirley Chavez    Seattle         2
3  NJ-2014-115812        Brian Ryan  Westfield         1
4  NJ-2017-114412   Benjamin Willis  Westfield         3
5  WA-2016-161389     Annie Jenkins    Seattle         6
6  NJ-2015-118983  Christina Little       Troy         6
7  WA-2014-105893     Annie Jenkins    Seattle         9
8  NJ-2014-167164     Ruby Matthews       Troy         6

In [107]:
pd.concat([ord1,ret1])

         Order ID          Customer       City  Quantity    Village
0  NJ-2016-152156     Raymond Young       Troy         6        NaN
1  NJ-2016-138688        Helen Dean  Westfield         7        NaN
2  WA-2015-108966    Shirley Chavez    Seattle         2        NaN
3  NJ-2014-115812        Brian Ryan  Westfield         1        NaN
4  NJ-2017-114412   Benjamin Willis  Westfield         3        NaN
5  WA-2016-161389     Annie Jenkins    Seattle         6        NaN
6  NJ-2015-118983  Christina Little       Troy         6        NaN
7  WA-2014-105893     Annie Jenkins    Seattle         9        NaN
8  NJ-2014-167164     Ruby Matthews       Troy         6        NaN
0  NJ-2016-152156     Raymond Young        NaN         6       Troy
1  NJ-2016-138688        Helen Dean        NaN         7  Westfield
2  WA-2015-108966    Shirley Chavez        NaN         2    Seattle
3  NJ-2014-115812        Brian Ryan        NaN         1  Westfield
4  NJ-2017-114412   Benjamin Willis        NaN         3  Westfield
5  WA-2016-161389     Annie Jenkins        NaN         6    Seattle
6  NJ-2015-118983  Christina Little        NaN         6       Troy
7  WA-2014-105893     Annie Jenkins        NaN         9    Seattle
8  NJ-2014-167164     Ruby Matthews        NaN         6       Troy

In [108]:
orders.columns

Index(['Order ID', 'Customer', 'City', 'Quantity', 'Price'], dtype='object')

In [112]:
orders.rename(columns = {"Order ID" : "Unique_ID"}, inplace = True)

In [113]:
orders.columns

Index(['Unique_ID', 'Customer', 'City', 'Quantity', 'Price'], dtype='object')

In [115]:
returns.columns

Index(['Order ID', 'Customer', 'City', 'State'], dtype='object')

In [116]:
innerJoin = pd.merge(left=orders, right=returns, 
                     how="inner", left_on="Unique_ID", right_on="Order ID")

In [117]:
innerJoin.head()

,Unique_ID,Customer_x,City_x,Quantity,Price,Order ID,Customer_y,City_y,State
0,WA-2016-117590,Judy Sanchez,Seattle,7,53.35,WA-2016-117590,Judy Sanchez,Seattle,Washington
1,WA-2015-117415,Harold Hunter,Seattle,4,12.42,WA-2015-117415,Harold Hunter,Seattle,Washington
2,MA-2017-120999,Lori Shaw,Lowell,7,16.32,MA-2017-120999,Lori Shaw,Lowell,Massachusetts
3,NJ-2016-101343,Sandra Hicks,Troy,1,53.35,NJ-2016-101343,Sandra Hicks,Troy,New York
4,MA-2017-139619,Roger Gomez,Lowell,7,16.32,MA-2017-139619,Roger Gomez,Lowell,Massachusetts

In [118]:
innerJoin = pd.merge(left=orders, right=returns, 
                     how="inner", left_index=True,right_index=True)

In [119]:
innerJoin.head()

,Unique_ID,Customer_x,City_x,Quantity,Price,Order ID,Customer_y,City_y,State
0,NJ-2016-152156,Raymond Young,Troy,6,12.42,NJ-2016-273214,Raymond Young,Troy,New York
1,NJ-2016-138688,Helen Dean,Westfield,7,17.83,NJ-2016-271456,Helen Dean,Westfield,New Jersey
2,WA-2015-108966,Shirley Chavez,Seattle,2,53.35,WA-2015-451988,Shirley Chavez,Seattle,Washington
3,NJ-2014-115812,Brian Ryan,Westfield,1,53.35,NJ-2014-352961,Brian Ryan,Westfield,New Jersey
4,NJ-2017-114412,Benjamin Willis,Westfield,3,17.83,NJ-2017-213231,Benjamin Willis,Westfield,New Jersey

In [120]:
# Query

In [121]:
orders.head()

        Unique_ID         Customer       City  Quantity  Price
0  NJ-2016-152156    Raymond Young       Troy         6  12.42
1  NJ-2016-138688       Helen Dean  Westfield         7  17.83
2  WA-2015-108966   Shirley Chavez    Seattle         2  53.35
3  NJ-2014-115812       Brian Ryan  Westfield         1  53.35
4  NJ-2017-114412  Benjamin Willis  Westfield         3  17.83

In [123]:
orders[orders.columns[::-1]].head(0)

Empty DataFrame
Columns: [Price, Quantity, City, Customer, Unique_ID]
Index: []

In [126]:
orders.iloc[:,::-1].head(0)

Empty DataFrame
Columns: [Price, Quantity, City, Customer, Unique_ID]
Index: []

In [132]:
orders.loc[:,orders.columns[::-1]].head(0)

Empty DataFrame
Columns: [Price, Quantity, City, Customer, Unique_ID]
Index: []